# IsBuiltInCategoryValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..IsBuiltInCategoryValid Method
Category Class See Also
---
Checks if a Category exists for a given BuiltInCategory.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public static bool IsBuiltInCategoryValid(
	BuiltInCategory builtInCategory
)
```

Visual Basic
---
```text
Public Shared Function IsBuiltInCategoryValid ( _
	builtInCategory As BuiltInCategory _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsBuiltInCategoryValid(
	BuiltInCategory builtInCategory
)
```

# ### Parameters
builtInCategory
    Type: Autodesk.Revit.DB..::..BuiltInCategory The BuiltInCategory to check.
# Remarks
Some BuiltInCategory values are obsolete and are kept for upgrade reasons. For those no Category exists.
# See Also
Category Class
Autodesk.Revit.DB Namespace